
# ПЕРЕМЕННЫЕ
a = 2 # переменной присваиваем значение 2
b = 3
print(a+b)
b = b + 3
# Виды операций с переменными
# +=, -=, *=, /=, //=, %=, **=
# a += 3, увеличение значения на 3 (аналог a = a + 3)
    # Имя переменной:
# может состтоять из букв (строчных и прописных)
# должно начинаться с буквы или подчеркивания _
# не должно являться ключевым словом (например True)
# регистр букв имеет значение (например "а" и "А" это разные переменные)

# Переменная может менять тип по ходу выполения программы (Динамическая типизация)
# a = 2
# a = 'abcaba'
# a = foo()
#
# type(a) - ?

print(b)